Res-container-random-v6/container_t_10_c_30_frontCore_2_wrkCore_1/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4751.043ms, rate sampling interval: 17760ms
  Thread calibration: mean lat.: 4662.998ms, rate sampling interval: 17711ms
  Thread calibration: mean lat.: 4733.367ms, rate sampling interval: 17727ms
  Thread calibration: mean lat.: 4657.475ms, rate sampling interval: 17793ms
  Thread calibration: mean lat.: 4726.780ms, rate sampling interval: 17842ms
  Thread calibration: mean lat.: 4672.706ms, rate sampling interval: 17711ms
  Thread calibration: mean lat.: 4687.137ms, rate sampling interval: 17711ms
  Thread calibration: mean lat.: 4702.908ms, rate sampling interval: 17891ms
  Thread calibration: mean lat.: 4692.243ms, rate sampling interval: 17842ms
  Thread calibration: mean lat.: 4729.121ms, rate sampling interval: 17711ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    35.49s    14.13s    0.98m    58.78%
    Req/Sec   117.10      1.51   120.00     85.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   35.85s 
 75.000%   47.68s 
 90.000%    0.91m 
 99.000%    0.98m 
 99.900%    0.99m 
 99.990%    0.99m 
 99.999%    0.99m 
100.000%    0.99m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9830.399     0.000000            1         1.00
   15810.559     0.100000         6095         1.11
   21233.663     0.200000        12192         1.25
   25591.807     0.300000        18289         1.43
   30769.151     0.400000        24399         1.67
   35848.191     0.500000        30534         2.00
   38666.239     0.550000        33531         2.22
   40894.463     0.600000        36623         2.50
   43319.295     0.650000        39653         2.86
   45350.911     0.700000        42695         3.33
   47677.439     0.750000        45725         4.00
   48824.319     0.775000        47250         4.44
   50003.967     0.800000        48766         5.00
   51150.847     0.825000        50297         5.71
   52494.335     0.850000        51853         6.67
   53673.983     0.875000        53356         8.00
   54132.735     0.887500        54137         8.89
   54624.255     0.900000        54877        10.00
   55214.079     0.912500        55667        11.43
   55771.135     0.925000        56405        13.33
   56524.799     0.937500        57144        16.00
   56950.783     0.943750        57551        17.78
   57311.231     0.950000        57920        20.00
   57573.375     0.956250        58337        22.86
   57769.983     0.962500        58694        26.67
   57966.591     0.968750        59073        32.00
   58064.895     0.971875        59269        35.56
   58163.199     0.975000        59462        40.00
   58294.271     0.978125        59619        45.71
   58490.879     0.981250        59822        53.33
   58621.951     0.984375        60022        64.00
   58687.487     0.985938        60123        71.11
   58753.023     0.987500        60201        80.00
   58851.327     0.989062        60316        91.43
   58916.863     0.990625        60390       106.67
   59015.167     0.992188        60488       128.00
   59080.703     0.992969        60547       142.22
   59113.471     0.993750        60572       160.00
   59146.239     0.994531        60619       182.86
   59179.007     0.995313        60670       213.33
   59244.543     0.996094        60766       256.00
   59244.543     0.996484        60766       284.44
   59244.543     0.996875        60766       320.00
   59277.311     0.997266        60814       365.71
   59277.311     0.997656        60814       426.67
   59310.079     0.998047        60835       512.00
   59342.847     0.998242        60871       568.89
   59342.847     0.998437        60871       640.00
   59342.847     0.998633        60871       731.43
   59375.615     0.998828        60899       853.33
   59375.615     0.999023        60899      1024.00
   59375.615     0.999121        60899      1137.78
   59408.383     0.999219        60911      1280.00
   59408.383     0.999316        60911      1462.86
   59441.151     0.999414        60935      1706.67
   59441.151     0.999512        60935      2048.00
   59441.151     0.999561        60935      2275.56
   59441.151     0.999609        60935      2560.00
   59441.151     0.999658        60935      2925.71
   59441.151     0.999707        60935      3413.33
   59441.151     0.999756        60935      4096.00
   59473.919     0.999780        60947      4551.11
   59473.919     0.999805        60947      5120.00
   59473.919     0.999829        60947      5851.43
   59473.919     0.999854        60947      6826.67
   59473.919     0.999878        60947      8192.00
   59473.919     0.999890        60947      9102.22
   59473.919     0.999902        60947     10240.00
   59473.919     0.999915        60947     11702.86
   59473.919     0.999927        60947     13653.33
   59473.919     0.999939        60947     16384.00
   59473.919     0.999945        60947     18204.44
   59473.919     0.999951        60947     20480.00
   59473.919     0.999957        60947     23405.71
   59473.919     0.999963        60947     27306.67
   59506.687     0.999969        60949     32768.00
   59506.687     1.000000        60949          inf
#[Mean    =    35491.910, StdDeviation   =    14134.702]
#[Max     =    59473.920, Total count    =        60949]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  72382 requests in 1.00m, 29.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 23
Requests/sec:   1205.68
Transfer/sec:    511.39KB